perf/results/mysql/read_50rps.txt
Running 30s test @ http://localhost:9411
  2 threads and 20 connections
  Thread calibration: mean lat.: 15.343ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 15.369ms, rate sampling interval: 26ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.65ms    0.92ms   9.49ms   75.71%
    Req/Sec    25.44     62.03   250.00     87.31%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.57ms
 75.000%    3.07ms
 90.000%    3.73ms
 99.000%    5.23ms
 99.900%    9.36ms
 99.990%    9.49ms
 99.999%    9.49ms
100.000%    9.49ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.351     0.000000            1         1.00
       1.690     0.100000           99         1.11
       1.978     0.200000          196         1.25
       2.189     0.300000          294         1.43
       2.367     0.400000          393         1.67
       2.569     0.500000          491         2.00
       2.641     0.550000          539         2.22
       2.749     0.600000          588         2.50
       2.855     0.650000          637         2.86
       2.969     0.700000          686         3.33
       3.067     0.750000          736         4.00
       3.151     0.775000          760         4.44
       3.245     0.800000          785         5.00
       3.351     0.825000          809         5.71
       3.495     0.850000          833         6.67
       3.607     0.875000          858         8.00
       3.667     0.887500          870         8.89
       3.735     0.900000          882        10.00
       3.805     0.912500          895        11.43
       3.935     0.925000          907        13.33
       4.035     0.937500          919        16.00
       4.085     0.943750          925        17.78
       4.163     0.950000          931        20.00
       4.219     0.956250          938        22.86
       4.371     0.962500          944        26.67
       4.535     0.968750          950        32.00
       4.567     0.971875          953        35.56
       4.615     0.975000          956        40.00
       4.707     0.978125          959        45.71
       4.755     0.981250          962        53.33
       5.039     0.984375          965        64.00
       5.119     0.985938          967        71.11
       5.143     0.987500          968        80.00
       5.227     0.989062          970        91.43
       5.527     0.990625          971       106.67
       5.687     0.992188          973       128.00
       5.759     0.992969          974       142.22
       5.759     0.993750          974       160.00
       5.763     0.994531          975       182.86
       6.071     0.995313          976       213.33
       6.735     0.996094          977       256.00
       6.735     0.996484          977       284.44
       6.735     0.996875          977       320.00
       7.099     0.997266          978       365.71
       7.099     0.997656          978       426.67
       9.359     0.998047          979       512.00
       9.359     0.998242          979       568.89
       9.359     0.998437          979       640.00
       9.359     0.998633          979       731.43
       9.359     0.998828          979       853.33
       9.495     0.999023          980      1024.00
       9.495     1.000000          980          inf
#[Mean    =        2.652, StdDeviation   =        0.917]
#[Max     =        9.488, Total count    =          980]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1502 requests in 30.00s, 246.37KB read
  Non-2xx or 3xx responses: 118
Requests/sec:     50.06
Transfer/sec:      8.21KB